############################################
#
# Auto-generated project tcl file:
#  * sets up variable
#  * runs customized script
#
############################################
sh date

{% if toplevel -%}
set TOP_MODULE {{ toplevel }}
{%- endif %}

{% if pp_script -%}
set PP_SCRIPT {{ pp_script }}
{% else %}
set PP_SCRIPT pt_script.tcl
{%- endif %}

set PRWD [pwd]
{% if script_dir -%}
set SCRIPT_DIR {{ script_dir }}
{% else %}
set SCRIPT_DIR "./"
{% endif %}

{% if report_dir -%}
set REPORT_DIR {{ report_dir }}
sh mkdir -p ${REPORT_DIR}
{% else %}
set REPORT_DIR "./"
{%- endif %}

{% if lib_dir -%}
set lib_dir {{ lib_dir }}
{%- endif %}

{% if target_library -%}
set target_library {{ target_library }}
{%- endif %}

{% if incdirs -%}
set search_path [list "." "{{ lib_dir }}" "{{ verilog_dir }}" {{ incdirs|join(' ') }}]
{% else %}
set_app_var search_path ". {{ lib_dir }} \
                 {{verilog_dir}} "
{%- endif %}

{% if libs -%}
set_app_var link_path [concat "*"  {{ libs }}]
{%- endif %}

{% if netlistpath -%}
read_verilog {{ netlistpath }}
current_design ${TOP_MODULE}
link_design
{%- endif %}

{% for src_file in src_files if src_file|src_file_filter%}
{{ src_file|src_file_filter }}
{% endfor %}

############################################
#
# Run custom script
#
############################################

source "${SCRIPT_DIR}/${PP_SCRIPT}"

# This section is used to run a python script , alternative to using fusesoc hooks
{% if postbuildpy -%}
set pythonScriptPath {{ postbuildpy }}
set pythonScriptName [file tail $pythonScriptPath]
file copy -force $pythonScriptPath [file join [file dirname [info script]] $pythonScriptName]
exec python3 [file join [file dirname [info script]] $pythonScriptName]
{%- endif %}

############################################
#
#  all done -- exit
#
############################################
sh date
exit